INSERT INTO director (NAME)
VALUES ('Стивен Спилберг'),
       ('Майкл Бэй'),
       ('Роб Коэн'),
       ('Стивен Младший');

INSERT INTO user_filmorate (email, login, name, birthday)
VALUES ('hp@ya.ru', 'hp', 'harry potter', '2000-12-1'),
       ('hp2@ya.ru', 'hp', 'harry potter', '2000-12-1'),
       ('hp3@ya.ru', 'hp', 'harry potter', '2000-12-1'),
       ('hp4@ya.ru', 'hp', 'harry potter', '2000-12-1'),
       ('hp5@ya.ru', 'hp', 'harry potter', '2000-12-1'),
       ('hp6@ya.ru', 'hp', 'harry potter', '2000-12-1'),
       ('dt7@ya.ru', 'hp', 'Доминик  Торетто', '1967-07-18');

INSERT INTO film (name, release_date, duration, rating_mpa)
VALUES ('один дома 1', '2000-10-10', 100, 1),
       ('один дома 2', '2000-10-10', 100, 1),
       ('один дома 3', '2001-10-10', 100, 1),
       ('один дома 4', '2001-10-10', 100, 1),
       ('один дома 5', '2002-10-10', 100, 1),
       ('один дома 6', '2002-10-10', 100, 1),
       ('один дома 7', '2022-10-10', 100, 1),
       ('один дома 8', '2022-10-10', 100, 1),
       ('один дома 9', '2022-10-10', 100, 1),
       ('один дома 10', '2022-10-10', 100, 1),
       ('один дома 11', '2022-10-10', 100, 1),
       ('один дома 12', '2026-10-10', 100, 1),
       ('форсаж 1', '2025-10-10', 200, 2),
       ('форсаж 2', '2025-10-10', 200, 2),
       ('Самый младший в семье 15', '1991-10-10', 200, 2),
       ('Смешарики', '1991-10-10', 200, 2);

INSERT INTO film_genre (film_id, genre_id)
VALUES (1, 1),
       (2, 1),
       (3, 1),
       (4, 1),
       (5, 2),
       (6, 2);

INSERT INTO film_like(film_id, user_id)
VALUES (2, 1),
       (2, 2),
       (2, 3),
       (1, 1),
       (1, 2),
       (3, 1),
       (10, 1),
       (11, 1),
       (11, 2),
       (11, 3),
       (11, 4),
       (12, 6),
       (14, 7),
       (15, 7);

INSERT INTO film_director(film_id, director_id)
VALUES (13, 3),
       (14, 3),
       (16, 4);
